ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/C29/f29h85x_cpu_sys_regs.xml
<module id="CPU_SYS_REGS" HW_revision="" description="CPU SYS Registers">
	<register id="CPUSYSLOCK1" width="32" page="0" offset="0x0" instances="1" instaddr="4" internal="0" description="Lock bit for CPUSYS registers">
		<bitfield id="LPMCR" description="Lock bit for LPMCR Register" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIOLPMSEL0" description="Lock bit for GPIOLPMSEL0 Register" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIOLPMSEL1" description="Lock bit for GPIOLPMSEL1 Register" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CMPSSLPMSEL" description="Lock bit for CMPSSLPMSEL register" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="USER_REG1_SYSRSn" description="Lock bit for USER_REG1_SYSRSn" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="USER_REG2_SYSRSn" description="Lock bit for USER_REG2_SYSRSn" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="USER_REG1_XRSn" description="Lock bit for USER_REG1_XRSn" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="USER_REG2_XRSn" description="Lock bit for USER_REG2_XRSn" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="USER_REG1_PORESETn" description="Lock bit for USER_REG1_PORESETn" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="USER_REG2_PORESETn" description="Lock bit for USER_REG2_PORESETn" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="USER_REG3_PORESETn" description="Lock bit for USER_REG3_PORESETn" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="USER_REG4_PORESETn" description="Lock bit for USER_REG4_PORESETn" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="CPUID" width="32" page="0" offset="0xc" instances="1" instaddr="4" internal="0" description="Indicates CPU1, CPU2.. CPU6">
		<bitfield id="CPUID" description="Indicates CPU1, CPU2, CPU3, CPU4, CPU5 or CPU6" begin="1" end="0" width="2" rwaccess="R"/>
	</register>
	<register id="LPMCR" width="32" page="0" offset="0x28" instances="1" instaddr="4" internal="0" description="LPM Control Register">
		<bitfield id="LPM" description="Low Power Mode setting" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="QUALSTDBY" description="STANDBY Wakeup Pin Qualification Setting" begin="7" end="2" width="6" rwaccess="RW"/>
		<bitfield id="WDINTE" description="Enable for WDINT wakeup from STANDBY" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="CMPSSLPMSEL" width="32" page="0" offset="0x2c" instances="1" instaddr="4" internal="0" description="CMPSS LPM Wakeup select registers">
		<bitfield id="CMPSS1H" description="CMPSS1H Enable for LPM Wakeup" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS1L" description="CMPSS1L Enable for LPM Wakeup" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS2H" description="CMPSS2H Enable for LPM Wakeup" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS2L" description="CMPSS2L Enable for LPM Wakeup" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS3H" description="CMPSS3H Enable for LPM Wakeup" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS3L" description="CMPSS3L Enable for LPM Wakeup" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS4H" description="CMPSS4H Enable for LPM Wakeup" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS4L" description="CMPSS4L Enable for LPM Wakeup" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS5H" description="CMPSS5H Enable for LPM Wakeup" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS5L" description="CMPSS5L Enable for LPM Wakeup" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS6H" description="CMPSS6H Enable for LPM Wakeup" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS6L" description="CMPSS6L Enable for LPM Wakeup" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS7H" description="CMPSS7H Enable for LPM Wakeup" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS7L" description="CMPSS7L Enable for LPM Wakeup" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS8H" description="CMPSS8H Enable for LPM Wakeup" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS8L" description="CMPSS8L Enable for LPM Wakeup" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS9H" description="CMPSS9H Enable for LPM Wakeup" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS9L" description="CMPSS9L Enable for LPM Wakeup" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS10H" description="CMPSS10H Enable for LPM Wakeup" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS10L" description="CMPSS10L Enable for LPM Wakeup" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS11H" description="CMPSS11H Enable for LPM Wakeup" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS11L" description="CMPSS11L Enable for LPM Wakeup" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS12H" description="CMPSS12H Enable for LPM Wakeup" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS12L" description="CMPSS12L Enable for LPM Wakeup" begin="23" end="23" width="1" rwaccess="RW"/>
	</register>
	<register id="GPIOLPMSEL0" width="32" page="0" offset="0x30" instances="1" instaddr="4" internal="0" description="GPIO LPM Wakeup select registers">
		<bitfield id="GPIO0" description="GPIO0 Enable for LPM Wakeup" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO1" description="GPIO1 Enable for LPM Wakeup" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO2" description="GPIO2 Enable for LPM Wakeup" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO3" description="GPIO3 Enable for LPM Wakeup" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO4" description="GPIO4 Enable for LPM Wakeup" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO5" description="GPIO5 Enable for LPM Wakeup" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO6" description="GPIO6 Enable for LPM Wakeup" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO7" description="GPIO7 Enable for LPM Wakeup" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO8" description="GPIO8 Enable for LPM Wakeup" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO9" description="GPIO9 Enable for LPM Wakeup" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO10" description="GPIO10 Enable for LPM Wakeup" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO11" description="GPIO11 Enable for LPM Wakeup" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO12" description="GPIO12 Enable for LPM Wakeup" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO13" description="GPIO13 Enable for LPM Wakeup" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO14" description="GPIO14 Enable for LPM Wakeup" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO15" description="GPIO15 Enable for LPM Wakeup" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO16" description="GPIO16 Enable for LPM Wakeup" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO17" description="GPIO17 Enable for LPM Wakeup" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO18" description="GPIO18 Enable for LPM Wakeup" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO19" description="GPIO19 Enable for LPM Wakeup" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO20" description="GPIO20 Enable for LPM Wakeup" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO21" description="GPIO21 Enable for LPM Wakeup" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO22" description="GPIO22 Enable for LPM Wakeup" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO23" description="GPIO23 Enable for LPM Wakeup" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO24" description="GPIO24 Enable for LPM Wakeup" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO25" description="GPIO25 Enable for LPM Wakeup" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO26" description="GPIO26 Enable for LPM Wakeup" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO27" description="GPIO27 Enable for LPM Wakeup" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO28" description="GPIO28 Enable for LPM Wakeup" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO29" description="GPIO29 Enable for LPM Wakeup" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO30" description="GPIO30 Enable for LPM Wakeup" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO31" description="GPIO31 Enable for LPM Wakeup" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPIOLPMSEL1" width="32" page="0" offset="0x34" instances="1" instaddr="4" internal="0" description="GPIO LPM Wakeup select registers">
		<bitfield id="GPIO32" description="GPIO32 Enable for LPM Wakeup" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO33" description="GPIO33 Enable for LPM Wakeup" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO34" description="GPIO34 Enable for LPM Wakeup" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO35" description="GPIO35 Enable for LPM Wakeup" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO36" description="GPIO36 Enable for LPM Wakeup" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO37" description="GPIO37 Enable for LPM Wakeup" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO38" description="GPIO38 Enable for LPM Wakeup" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO39" description="GPIO39 Enable for LPM Wakeup" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO40" description="GPIO40 Enable for LPM Wakeup" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO41" description="GPIO41 Enable for LPM Wakeup" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO42" description="GPIO42 Enable for LPM Wakeup" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO43" description="GPIO43 Enable for LPM Wakeup" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO44" description="GPIO44 Enable for LPM Wakeup" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO45" description="GPIO45 Enable for LPM Wakeup" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO46" description="GPIO46 Enable for LPM Wakeup" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO47" description="GPIO47 Enable for LPM Wakeup" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO48" description="GPIO48 Enable for LPM Wakeup" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO49" description="GPIO49 Enable for LPM Wakeup" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO50" description="GPIO50 Enable for LPM Wakeup" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO51" description="GPIO51 Enable for LPM Wakeup" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO52" description="GPIO52 Enable for LPM Wakeup" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO53" description="GPIO53 Enable for LPM Wakeup" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO54" description="GPIO54 Enable for LPM Wakeup" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO55" description="GPIO55 Enable for LPM Wakeup" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO56" description="GPIO56 Enable for LPM Wakeup" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO57" description="GPIO57 Enable for LPM Wakeup" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO58" description="GPIO58 Enable for LPM Wakeup" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO59" description="GPIO59 Enable for LPM Wakeup" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO60" description="GPIO60 Enable for LPM Wakeup" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO61" description="GPIO61 Enable for LPM Wakeup" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO62" description="GPIO62 Enable for LPM Wakeup" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO63" description="GPIO63 Enable for LPM Wakeup" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="TMR2CLKCTL" width="32" page="0" offset="0x38" instances="1" instaddr="4" internal="0" description="Timer2 Clock Measurement functionality control register">
		<bitfield id="TMR2CLKSRCSEL" description="CPU Timer 2 Clock Source Select Bit" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="TMR2CLKPRESCALE" description="CPU Timer 2 Clock Pre-Scale Value" begin="5" end="3" width="3" rwaccess="RW"/>
	</register>
	<register id="RESCCLR" width="32" page="0" offset="0x3c" instances="1" instaddr="4" internal="0" description="Reset Cause Clear Register">
		<bitfield id="POR" description="POR POR Reset Cause Clear Bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="XRSn" description="XRSn POR Reset Cause Clear Bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="WDRSn" description="WDRSn POR Reset Cause Clear Bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="NMIWDRSn" description="NMIWDRSn POR Reset Cause Clear Bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="ECAT_RESET_OUT" description="ECAT_RESET_OUT POR Reset Cause Clear Bit" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="SIMRESET_XRSn" description="SIMRESET_XRSn POR Reset Cause Clear Bit" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="ESMXRSn" description="ESMXRSn Reset Cause Clear Bit" begin="12" end="12" width="1" rwaccess="RW"/>
	</register>
	<register id="RESC" width="32" page="0" offset="0x40" instances="1" instaddr="4" internal="0" description="Reset Cause register">
		<bitfield id="POR" description="POR Reset Cause Indication Bit" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="XRSn" description="XRSn Reset Cause Indication Bit" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="WDRSn" description="WDRSn Reset Cause Indication Bit" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="NMIWDRSn" description="NMIWDRSn Reset Cause Indication Bit" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="ECAT_RESET_OUT" description="ECAT_RESET_OUT Reset Cause Indication Bit" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="SIMRESET_XRSn" description="SIMRESET_XRSn Reset Cause Indication Bit" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="ESMRESET" description="ESMRESET Reset Cause Indication Bit" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="XRSn_pin_status" description="XRSN Pin Status" begin="30" end="30" width="1" rwaccess="R"/>
		<bitfield id="DCON" description="Debugger connection status to C29x CPU" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="MCANWAKESTATUS" width="32" page="0" offset="0x70" instances="1" instaddr="4" internal="0" description="MCAN Wake Status Register">
		<bitfield id="WAKE_MCANA" description="WAKE_MCANA Wake Status " begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="WAKE_MCANB" description="WAKE_MCANB Wake Status " begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="WAKE_MCANC" description="WAKE_MCANC Wake Status " begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="WAKE_MCAND" description="WAKE_MCAND Wake Status " begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="WAKE_MCANE" description="WAKE_MCANE Wake Status " begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="WAKE_MCANF" description="WAKE_MCANF Wake Status " begin="5" end="5" width="1" rwaccess="R"/>
	</register>
	<register id="MCANWAKESTATUSCLR" width="32" page="0" offset="0x74" instances="1" instaddr="4" internal="0" description="MCAN Wake Status Clear Register">
		<bitfield id="WAKE_MCANA" description="Cear bit for MCANWAKESTATUS.WAKE_MCANA bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="WAKE_MCANB" description="Cear bit for MCANWAKESTATUS.WAKE_MCANB bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="WAKE_MCANC" description="Cear bit for MCANWAKESTATUS.WAKE_MCANC bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="WAKE_MCAND" description="Cear bit for MCANWAKESTATUS.WAKE_MCAND bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="WAKE_MCANE" description="Cear bit for MCANWAKESTATUS.WAKE_MCANE bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="WAKE_MCANF" description="Cear bit for MCANWAKESTATUS.WAKE_MCANF bit" begin="5" end="5" width="1" rwaccess="RW"/>
	</register>
	<register id="CLKSTOPREQ" width="32" page="0" offset="0x78" instances="1" instaddr="4" internal="0" description="Peripheral Clock Stop Request Register">
		<bitfield id="MCAN_A" description="MCAN_A Clock Stop Request Bit" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="MCAN_B" description="MCAN_B Clock Stop Request Bit" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="MCAN_C" description="MCAN_C Clock Stop Request Bit" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="MCAN_D" description="MCAN_D Clock Stop Request Bit" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="MCAN_E" description="MCAN_E Clock Stop Request Bit" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="MCAN_F" description="MCAN_F Clock Stop Request Bit" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="Key for register write " begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="CLKSTOPACK" width="32" page="0" offset="0x7c" instances="1" instaddr="4" internal="0" description="Peripheral Clock Stop Ackonwledge Register">
		<bitfield id="MCAN_A" description="MCAN_A Clock Stop Ack Bit" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="MCAN_B" description="MCAN_B Clock Stop Ack Bit" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="MCAN_C" description="MCAN_C Clock Stop Ack Bit" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="MCAN_D" description="MCAN_D Clock Stop Ack Bit" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="MCAN_E" description="MCAN_E Clock Stop Ack Bit" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="MCAN_F" description="MCAN_F Clock Stop Ack Bit" begin="13" end="13" width="1" rwaccess="R"/>
	</register>
	<register id="USER_REG1_SYSRSn" width="32" page="0" offset="0x80" instances="1" instaddr="4" internal="0" description="Software Configurable registers reset by SYSRSn">
		<bitfield id="BITS" description="SW configurable bits" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="USER_REG2_SYSRSn" width="32" page="0" offset="0x84" instances="1" instaddr="4" internal="0" description="Software Configurable registers reset by SYSRSn">
		<bitfield id="BITS" description="SW configurable bits" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="USER_REG1_XRSn" width="32" page="0" offset="0x88" instances="1" instaddr="4" internal="0" description="Software Configurable registers reset by XRSn">
		<bitfield id="BITS" description="SW configurable bits" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="USER_REG2_XRSn" width="32" page="0" offset="0x8c" instances="1" instaddr="4" internal="0" description="Software Configurable registers reset by XRSn">
		<bitfield id="BITS" description="SW configurable bits" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="USER_REG1_PORESETn" width="32" page="0" offset="0x90" instances="1" instaddr="4" internal="0" description="Software Configurable registers reset by PORESETn">
		<bitfield id="BITS" description="SW configurable bits" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="USER_REG2_PORESETn" width="32" page="0" offset="0x94" instances="1" instaddr="4" internal="0" description="Software Configurable registers reset by PORESETn">
		<bitfield id="BITS" description="SW configurable bits" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="USER_REG3_PORESETn" width="32" page="0" offset="0x98" instances="1" instaddr="4" internal="0" description="Software Configurable registers reset by PORESETn">
		<bitfield id="BITS" description="SW configurable bits" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="USER_REG4_PORESETn" width="32" page="0" offset="0x9c" instances="1" instaddr="4" internal="0" description="Software Configurable registers reset by PORESETn">
		<bitfield id="BITS" description="SW configurable bits" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="JTAG_MMR_REG" width="32" page="0" offset="0xa0" instances="1" instaddr="4" internal="0" description="Readback of JTAG registers for test purpose">
	</register>
	<register id="SIMRESET" width="32" page="0" offset="0xa4" instances="1" instaddr="4" internal="0" description="Simulated Reset Register">
		<bitfield id="XRSn" description="Generates a simulated XRSn" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="Key value to enable write" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="PARITY_TEST_ALT2" width="32" page="0" offset="0xa8" instances="1" instaddr="4" internal="0" description="Enables parity test">
		<bitfield id="TESTEN" description="Parity test enable configuration" begin="3" end="0" width="4" rwaccess="RW"/>
	</register>
</module>
